## Production
**✅ &nbsp; Terraform Init:** `success`
**✅ &nbsp; Terraform Validate:** `success`
**✅ &nbsp; Terraform Format:** `success`
**✅ &nbsp; Terraform Plan:** `success`
**✅ &nbsp; Conftest:** `success` 

**⚠️ &nbsp; Warning:** resources will be destroyed by this change!
```terraform
Plan: 1 to add, 6 to change, 1 to destroy
```

<details>
<summary>Show summary</summary>

|  CHANGE  |                                RESOURCE                                 |
|----------|-------------------------------------------------------------------------|
| update   | `aws_cloudwatch_log_metric_filter.superset_ecs_errors[&quot;celery-beat&quot;]`   |
|          | `aws_cloudwatch_log_metric_filter.superset_ecs_errors[&quot;celery-worker&quot;]` |
|          | `aws_cloudwatch_log_metric_filter.superset_ecs_errors[&quot;superset&quot;]`      |
|          | `module.celery_beat_ecs.aws_ecs_service.this`                           |
|          | `module.celery_worker_ecs.aws_ecs_service.this`                         |
|          | `module.superset_ecs.aws_ecs_service.this`                              |
| recreate | `module.celery_worker_ecs.aws_ecs_task_definition.this`                 |


</details>


<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
  ~ update in-place
-/+ destroy and then create replacement
 <= read (data resources)

Terraform will perform the following actions:

  # aws_cloudwatch_log_metric_filter.superset_ecs_errors["celery-beat"] will be updated in-place
  ~ resource "aws_cloudwatch_log_metric_filter" "superset_ecs_errors" {
        id             = "celery-beat-error"
        name           = "celery-beat-error"
      ~ pattern        = "[(w1=\"*CRITICAL*\" || w1=\"*ERROR*\") && w1!=\"*'Template' object has no attribute 'strip'*\" && w1!=\"*COLUMN_NOT_FOUND*\" && w1!=\"*Error on OAuth authorize*\" && w1!=\"*Failed to execute query*\" && w1!=\"*SYNTAX_ERROR*\"]" -> "[(w1=\"*CRITICAL*\" || w1=\"*ERROR*\") && w1!=\"*'Template' object has no attribute 'strip'*\" && w1!=\"*Error on OAuth authorize*\" && w1!=\"*Failed to execute query*\" && w1!=\"*GENERIC_DB_ENGINE_ERROR*\" && w1!=\"*SYNTAX_ERROR*\"]"
        # (1 unchanged attribute hidden)

        # (1 unchanged block hidden)
    }

  # aws_cloudwatch_log_metric_filter.superset_ecs_errors["celery-worker"] will be updated in-place
  ~ resource "aws_cloudwatch_log_metric_filter" "superset_ecs_errors" {
        id             = "celery-worker-error"
        name           = "celery-worker-error"
      ~ pattern        = "[(w1=\"*CRITICAL*\" || w1=\"*ERROR*\") && w1!=\"*'Template' object has no attribute 'strip'*\" && w1!=\"*COLUMN_NOT_FOUND*\" && w1!=\"*Error on OAuth authorize*\" && w1!=\"*Failed to execute query*\" && w1!=\"*SYNTAX_ERROR*\"]" -> "[(w1=\"*CRITICAL*\" || w1=\"*ERROR*\") && w1!=\"*'Template' object has no attribute 'strip'*\" && w1!=\"*Error on OAuth authorize*\" && w1!=\"*Failed to execute query*\" && w1!=\"*GENERIC_DB_ENGINE_ERROR*\" && w1!=\"*SYNTAX_ERROR*\"]"
        # (1 unchanged attribute hidden)

        # (1 unchanged block hidden)
    }

  # aws_cloudwatch_log_metric_filter.superset_ecs_errors["superset"] will be updated in-place
  ~ resource "aws_cloudwatch_log_metric_filter" "superset_ecs_errors" {
        id             = "superset-error"
        name           = "superset-error"
      ~ pattern        = "[(w1=\"*CRITICAL*\" || w1=\"*ERROR*\") && w1!=\"*'Template' object has no attribute 'strip'*\" && w1!=\"*COLUMN_NOT_FOUND*\" && w1!=\"*Error on OAuth authorize*\" && w1!=\"*Failed to execute query*\" && w1!=\"*SYNTAX_ERROR*\"]" -> "[(w1=\"*CRITICAL*\" || w1=\"*ERROR*\") && w1!=\"*'Template' object has no attribute 'strip'*\" && w1!=\"*Error on OAuth authorize*\" && w1!=\"*Failed to execute query*\" && w1!=\"*GENERIC_DB_ENGINE_ERROR*\" && w1!=\"*SYNTAX_ERROR*\"]"
        # (1 unchanged attribute hidden)

        # (1 unchanged block hidden)
    }

  # module.celery_beat_ecs.aws_ecs_service.this will be updated in-place
  ~ resource "aws_ecs_service" "this" {
        id                                 = "arn:aws:ecs:ca-central-1:066023111852:service/superset/celery-beat"
        name                               = "celery-beat"
      ~ propagate_tags                     = "NONE" -> "SERVICE"
        tags                               = {
            "CostCentre" = "cds-superset-prod"
            "Terraform"  = "true"
        }
      ~ task_definition                    = "arn:aws:ecs:ca-central-1:066023111852:task-definition/celery-beat:73" -> "arn:aws:ecs:ca-central-1:066023111852:task-definition/celery-beat:70"
        # (15 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.celery_worker_ecs.data.aws_ecs_task_definition.this_latest will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_ecs_task_definition" "this_latest" {
      + arn                  = (known after apply)
      + arn_without_revision = (known after apply)
      + execution_role_arn   = (known after apply)
      + family               = (known after apply)
      + id                   = (known after apply)
      + network_mode         = (known after apply)
      + revision             = (known after apply)
      + status               = (known after apply)
      + task_definition      = "celery-worker"
      + task_role_arn        = (known after apply)
    }

  # module.celery_worker_ecs.aws_ecs_service.this will be updated in-place
  ~ resource "aws_ecs_service" "this" {
        id                                 = "arn:aws:ecs:ca-central-1:066023111852:service/superset/celery-worker"
        name                               = "celery-worker"
      ~ propagate_tags                     = "NONE" -> "SERVICE"
        tags                               = {
            "CostCentre" = "cds-superset-prod"
            "Terraform"  = "true"
        }
      ~ task_definition                    = "arn:aws:ecs:ca-central-1:066023111852:task-definition/celery-worker:74" -> (known after apply)
        # (15 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.celery_worker_ecs.aws_ecs_task_definition.this must be replaced
-/+ resource "aws_ecs_task_definition" "this" {
      ~ arn                      = "arn:aws:ecs:ca-central-1:066023111852:task-definition/celery-worker:71" -> (known after apply)
      ~ arn_without_revision     = "arn:aws:ecs:ca-central-1:066023111852:task-definition/celery-worker" -> (known after apply)
      ~ cpu                      = "512" -> "1024" # forces replacement
      ~ id                       = "celery-worker" -> (known after apply)
      ~ memory                   = "1024" -> "2048" # forces replacement
      ~ revision                 = 71 -> (known after apply)
        tags                     = {
            "CostCentre" = "cds-superset-prod"
            "Terraform"  = "true"
        }
        # (11 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.superset_ecs.aws_ecs_service.this will be updated in-place
  ~ resource "aws_ecs_service" "this" {
        id                                 = "arn:aws:ecs:ca-central-1:066023111852:service/superset/superset"
        name                               = "superset"
      ~ propagate_tags                     = "NONE" -> "SERVICE"
        tags                               = {
            "CostCentre" = "cds-superset-prod"
            "Terraform"  = "true"
        }
      ~ task_definition                    = "arn:aws:ecs:ca-central-1:066023111852:task-definition/superset:91" -> "arn:aws:ecs:ca-central-1:066023111852:task-definition/superset:88"
        # (15 unchanged attributes hidden)

        # (5 unchanged blocks hidden)
    }

Plan: 1 to add, 6 to change, 1 to destroy.

Warning: Argument is deprecated

  with module.athena_bucket.aws_s3_bucket.this,
  on .terraform/modules/athena_bucket/S3/main.tf line 8, in resource "aws_s3_bucket" "this":
   8: resource "aws_s3_bucket" "this" {

Use the aws_s3_bucket_lifecycle_configuration resource instead

(and 2 more similar warnings elsewhere)

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: plan.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "plan.tfplan"

```

</details>

<details>
<summary>Show Conftest results</summary>

```sh
WARN - plan.json - main - Missing Common Tags: ["aws_athena_data_catalog.data_lake"]
WARN - plan.json - main - Missing Common Tags: ["aws_elasticache_subnet_group.superset"]
WARN - plan.json - main - Missing Common Tags: ["aws_iam_policy.superset_athena_read"]
WARN - plan.json - main - Missing Common Tags: ["aws_iam_role.superset_athena_read"]
WARN - plan.json - main - Missing Common Tags: ["aws_iam_role.superset_waf_logs"]
WARN - plan.json - main - Missing Common Tags: ["aws_kinesis_firehose_delivery_stream.superset_waf_logs"]

25 tests, 19 passed, 6 warnings, 0 failures, 0 exceptions

```

</details>
